cask_args appdir: "/Applications"

tap "universal-ctags/universal-ctags"

brew "bat"
brew "bitwarden-cli"
brew "colordiff"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "ghq"
brew "git-delta"
brew "gnupg"
brew "glow"
brew "herdr"
brew "jq"
brew "jnv"
brew "keychain"
brew "lf"
brew "mas"
brew "mise"
brew "nkf"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "trash"
brew "universal-ctags", args: ["HEAD"]
brew "vim"
brew "watch"
brew "wget"
brew "zsh"
brew "zoxide"

cask "aws-vault-binary"
cask "appcleaner"
cask "font-hackgen"
cask "font-udev-gothic"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "obsidian"
cask "qlmarkdown"
cask "raycast"
cask "visual-studio-code"

mas "Bitwarden", id: 1352778147
mas "Display Menu", id: 549083868
mas "CotEditor", id: 1024640650
mas "The Unarchiver", id: 425424353
